# --- Этап 1: Сборка (Builder) ---
# Используем конкретную версию Go на базе легковесного Alpine Linux
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем только файлы зависимостей
COPY go.mod go.sum ./

# Скачиваем зависимости. Этот слой будет кэшироваться и не будет перезапускаться,
# пока вы не измените go.mod или go.sum
RUN go mod download

# Теперь копируем весь остальной исходный код
COPY . .

# Собираем приложение.
# -o /server: скомпилировать и положить результат в корень под именем 'server'
# ./cmd/server: что именно собирать
# CGO_ENABLED=0: отключает использование C-библиотек, что делает бинарник статическим
# и позволяет ему работать в минималистичных образах типа scratch или alpine.
RUN CGO_ENABLED=0 go build -o /server ./cmd/server

# --- Этап 2: Финальный образ (Final) ---
# Используем самый минималистичный образ из возможных. В нём нет ничего, кроме вашего приложения.
FROM scratch

# Копируем рабочую директорию
WORKDIR /

# Копируем ТОЛЬКО скомпилированный бинарник из этапа 'builder'
COPY --from=builder /server /server

# Указываем, что наше приложение будет слушать порт 3333
EXPOSE 3333

# Команда для запуска приложения при старте контейнера
CMD ["/server"]
